test/performance/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">

    <clients>
        <client host="localhost" use_controller_vm="true"></client>
    </clients>

    <!-- Server side setup -->
    <servers>
        <server host="127.0.0.1" port="5222" type="tcp"></server>
    </servers>

    <load>
        <user session="xmpp-load" start_time="0" unit="minute"></user>
        <!-- <arrivalphase phase="1" duration="1" unit="minute"> -->
            <!-- <users interarrival="2" unit="second"></users> -->
            <!-- </arrivalphase> -->
    </load>

    <!-- JABBER parameters -->
    <!-- to synchronise users,  use a global acknoledgement -->
    <options>
        <option type="ts_jabber" name="global_number" value="100"></option>
        <option type="ts_jabber" name="userid_max" value="10000"></option>
        <option type="ts_jabber" name="domain" value="mydomain.org"></option>
        <option type="ts_jabber" name="username" value="user"></option>
        <option type="ts_jabber" name="passwd" value="pass"></option>
    </options>

    <sessions>
        <session probability="100" name="xmpp-load" type="ts_jabber">
            <request> <jabber type="connect" ack="local"></jabber> </request>
            <thinktime value="2"></thinktime>

            <transaction name="authenticate">
                <request> <jabber type="auth_sasl" ack="local"></jabber></request>
                <request> <jabber type="connect" ack="local"></jabber> </request>
                <request> <jabber type="auth_sasl_bind" ack="local" ></jabber></request>
                <request> <jabber type="auth_sasl_session" ack="local" ></jabber></request>
            </transaction>

            <request> <jabber type="iq:roster:get" ack="local"/> </request>
            <request> <jabber type="presence:initial" ack="no_ack"/> </request>

            <transaction name="close">
                <request> <jabber type="close" ack="local"> </jabber></request>
            </transaction>
        </session>
    </sessions>
</tsung>